const rawData = [
       { 
                cat: "常用條碼", brand: "冷氣運費", 
                name: "免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元     3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "常用條碼", brand: "冰箱運費", 
                name: "49-400006-001\n免費運費$10", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2449400006027"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "常用條碼", brand: "冰箱運費", 
                name: "49-400007-001\n免費運費$100", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2449400007024"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
           { 
                cat: "常用條碼", brand: "冰箱運費", 
                name: "49-400002-001\n收費運費$10", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2449400002029"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "常用條碼", brand: "冰箱運費", 
                name: "49-400003-001\n收費運費$100", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2449400003026"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "洗衣機運費", 
                name: "49-401006-001\n免費運費$10", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2449401006026"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
          { 
                cat: "常用條碼", brand: "洗衣機運費", 
                name: "49-401007-001\n免費運費$100", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2449401007023"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "洗衣機運費", 
                name: "49-401002-001\n收費運費$10", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2449401002028"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
          { 
                cat: "常用條碼", brand: "洗衣機運費", 
                name: "49-401003-001\n收費運費$100", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2449401003025"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "電視運費", 
                name: "49-440007-001\n免費運費$10", 
                desc: "電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2449440007022"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "常用條碼", brand: "電視運費", 
                name: "49-440008-001\n免費運費$100", 
                desc: "電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2449440008029"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "電視運費", 
                name: "49-440003-001\n收費運費$10", 
                desc: "電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2449440003024"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
             { 
                cat: "常用條碼", brand: "電視運費", 
                name: "49-440004-001\n收費運費$100", 
                desc: "電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2449440004021"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                         { 
                cat: "常用條碼", brand: "跨店運費叩號", 
                name: "跨店出貨打SBS單時，請使用手打方式key in\n好方便輸入以下跨店運費叩號  \n系統才會自動移撥", 
                desc: "<span class='text-blue'>49-000002-001</span> \n收費$10\n<span class='text-blue'>49-000003-001</span> \n收費$100\n<span class='text-blue'>49-000006-001</span> \n免運$10\n<span class='text-blue'>49-000007-001</span> \n免運$100", 
                barcode: [""], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$0</span>-<span class='text-red'>$10,000</span>\n(3+2)", 
                desc: "費用$1700\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043032011","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$10,001</span>-<span class='text-red'>$15,000</span>\n(3+2)", 
                desc: "費用$1950\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043010019","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$15,001</span>-<span class='text-red'>$20,000</span>\n(3+2)", 
                desc: "費用$2150\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043012013","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$20,001</span>-<span class='text-red'>$25,000</span>\n(3+2)", 
                desc: "費用$2350\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043014017","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$25,001</span>-<span class='text-red'>$30,000</span>\n(3+2)", 
                desc: "費用$3150\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043016011","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$30,001</span>-<span class='text-red'>$40,000</span>\n(3+2)", 
                desc: "費用$4150\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043018015","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$40,001</span>-<span class='text-red'>$50,000</span>\n(3+2)", 
                desc: "費用$6150\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043020018","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$50,001</span>-<span class='text-red'>$70,000</span>\n(3+2)", 
                desc: "費用$8900\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043022012","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$70,001</span>-<span class='text-red'>$100,000</span>\n(3+2)", 
                desc: "費用$11900\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043024016","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$100,001</span>-<span class='text-red'>$150,000</span>\n(3+2)", 
                desc: "費用$15000\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043026010","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },         { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視保固\n<span class='text-red'>$150,001</span>-<span class='text-red'>$200,000</span>\n(3+2)", 
                desc: "費用$19900\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043028014","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
                  { 
                cat: "常用條碼", brand: "電視保固(3+2)", 
                name: "電視運費\n49-440007-001\n免費運費$10", 
                desc: "電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2449440007022"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$0</span>-<span class='text-red'>$10,000</span>\n(2+2)", 
                desc: "費用$1500\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043002014","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$10,001</span>-<span class='text-red'>$15,000</span>\n(2+2)", 
                desc: "費用$1700\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043035012","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$15,001</span>-<span class='text-red'>$20,000</span>\n(2+2)", 
                desc: "費用$1900\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043036019","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$20,001</span>-<span class='text-red'>$25,000</span>\n(2+2)", 
                desc: "費用$2100\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043037016","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$25,001</span>-<span class='text-red'>$30,000</span>\n(2+2)", 
                desc: "費用$2600\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043038013","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$30,001</span>-<span class='text-red'>$40,000</span>\n(2+2)", 
                desc: "費用$3600\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043039010","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$40,001</span>-<span class='text-red'>$50,000</span>\n(2+2)", 
                desc: "費用$5500\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043040016","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$50,001</span>-<span class='text-red'>$70,000</span>\n(2+2)", 
                desc: "費用$7800\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043041013","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$70,001</span>-<span class='text-red'>$100,000</span>\n(2+2)", 
                desc: "費用$11000\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span></span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043042010","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
        { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$100,001</span>-<span class='text-red'>$150,000</span>\n(2+2)", 
                desc: "費用$14000\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043043017","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },         { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視保固\n<span class='text-red'>$150,001</span>-<span class='text-red'>$200,000</span>\n(2+2)", 
                desc: "費用$17000\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2448043044014","2449440007022","2449440003024"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "常用條碼", brand: "電視保固(2+2)", 
                name: "電視運費\n49-440007-001\n免費運費$10", 
                desc: "電視32吋吋以下$300\n 電視33-49吋$450\n 電視50-54吋$550\n 電視55-59吋$600\n 電視60-74吋$700\n電視75吋以上$1300", 
                barcode: ["2449440007022"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$0</span>-<span class='text-red'>$6,000</span>\n(1+2)非", 
                desc: "費用$500\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000014012","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$6,001</span>-<span class='text-red'>$10,000</span>\n(1+2)非", 
                desc: "費用$600\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000018010","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$10,001</span>-<span class='text-red'>$15,000</span>\n(1+2)非", 
                desc: "費用$700\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000022017","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },  
    { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$15,001</span>-<span class='text-red'>$20,000</span>\n(1+2)非", 
                desc: "費用$800\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000026015","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$20,001</span>-<span class='text-red'>$25,000</span>\n(1+2)非", 
                desc: "費用$900\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000030012","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$25,001</span>-<span class='text-red'>$30,000</span>\n(1+2)非", 
                desc: "費用$1200\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000034010","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$30,001</span>-<span class='text-red'>$40,000</span>\n(1+2)非", 
                desc: "費用$1550\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000038018","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$40,001</span>-<span class='text-red'>$50,000</span>\n(1+2)非", 
                desc: "費用$2000\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000042015","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱\n<span class='text-red'>$50,001</span>以上\n(1+2)非", 
                desc: "費用$2950\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/市內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2448000046013","2449400006027","2449400002029"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "常用條碼", brand: "冰箱保固(1+2)非", 
                name: "冰箱運費\n49-400006-001\n免費運費$10", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["2449400006027"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                 { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$0</span>-<span class='text-red'>$6,000</span>\n(1+2)非", 
                desc: "費用$450\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001014011","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$6,001</span>-<span class='text-red'>$10,000</span>\n(1+2)非", 
                desc: "費用$600\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001018019","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
      { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>10,001</span>-<span class='text-red'>$15,000</span>\n(1+2)非", 
                desc: "費用$850\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001022016","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            }, 
    { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$15,001</span>-<span class='text-red'>$20,000</span>\n(1+2)非", 
                desc: "費用$1300\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001026014","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$20,001</span>-<span class='text-red'>$25,000</span>\n(1+2)非", 
                desc: "費用$1500\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001030011","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$25,001</span>-<span class='text-red'>$30,000</span>\n(1+2)非", 
                desc: "費用$1700\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001034019","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$30,001</span>-<span class='text-red'>$40,000</span>\n(1+2)非", 
                desc: "費用$2100\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001038017","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗/烘衣機\n<span class='text-red'>$40,001</span>-<span class='text-red'>$50,000</span>\n(1+2)非", 
                desc: "費用$2800\n<span class='text-gray'>第一個是保固條碼\n第二個是免運$10條碼\n第三個是收費$10條碼</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2448001042014","2449401006026","2449401002028"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "常用條碼", brand: "洗/烘衣機保固(1+2)非", 
                name: "洗衣機運費\n49-401006-001\n免費運費$10", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["2449401006026"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
    { 
                cat: "常用條碼", brand: "清洗服務", 
                name: "冷氣1-1室內機清洗$1900\n47-011001-001", 
                desc: "單洗室內機\n一對多室內機請使用其他條碼", 
                barcode: ["2447011001011"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "分離式室內機清洗(國際牌變形金剛)$3200\n47-011005-001", 
                desc: "國際牌分離式室內機面板會主動向上升起/向外滑動的機型請使用這個結帳\n※RX系列‵PX 系列‵QX 系列‵VX 系列‵早期 LX 系列", 
                barcode: ["2447011005019"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "分離式室內機清洗(富士通壁掛型專用)$2880\n47-011006-001", 
                desc: "富士通分離式室請使用這個結帳\n富士通的頂級系列有自動濾網清潔系統等較複雜排線\n※nocria Z 系列‵nocria X 系列‵nocria S 系列", 
                barcode: ["2447011006016"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "冷氣1-2室內機清洗$3900\n47-011002-001", 
                desc: "請依照一對多的室內機尋找正確條碼結帳", 
                barcode: ["2447011002018"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "冷氣1-3室內機清洗$5700\n47-011003-001", 
                desc: "請依照一對多的室內機尋找正確條碼結帳", 
                barcode: ["2447011003015"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "冷氣1-4室內機清洗$7400\n47-011004-001", 
                desc: "請依照一對多的室內機尋找正確條碼結帳", 
                barcode: ["2447011004012"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "分離式室外機清洗$650\n47-012001-001", 
                desc: "1-1和一對多的室外機都請使用這個", 
                barcode: ["2447012001010"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "直立式洗衣機清洗$1900\n47-000001-001", 
                desc: "直立式洗衣機請使用這條碼結帳", 
                barcode: ["2447000001015"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
{ 
                cat: "常用條碼", brand: "清洗服務", 
                name: "滾筒式洗衣機清洗$3800\n47-001001-001", 
                desc: "滾筒式洗衣機請使用這條碼結帳", 
                barcode: ["2447001001014"], 
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            // --- 家電資料 ---
                       { 
                cat: "冷氣", brand: "大金", 
                name: "一對一機型20 ~ 36現折<span class='text-red'>$2,000</span>\n一對一機型40 ~ 90現折<span class='text-red'>$3,000</span>\n一對二機型2MXM現折<span class='text-red'>$4,000</span>\n一對三、一對四機型3MXM,4MXM現折<span class='text-red'>$5,000</span>", 
                desc: "2026/3/1 ~ 2026/7/31\n金豪禮現折 ", 
                barcode: "", img: "", qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "冷氣", brand: "大金", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元   \n  3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
             { 
                cat: "冷氣", brand: "國際", 
                name: "4月1日起購買家用空調指定機種，現金回饋最高省12000元！", 
                desc: "國際活動官網申請\n發票: 2026.4.01~2026.07.31\n登錄最晚至 2026.08.15\n<span class='text-red '>今年現金回饋只針對冷暖\n冷專和窗型無回饋金　請注意!!!!</span>\n現金回饋$8000機種:UX 超高效系列\n現金回饋$2000機種:VX極致旗艦系列，UX頂級旗艦系列，UX旗艦系列，UJ系列，一對多系列<span class='text-red '>*以室外機計算*</span>\n現金回饋$1000機種:UK．K標準系列", 
                barcode: "", 
                img: "冷氣贈品/2026.jpg",
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=5D143BC7-EAFB-472D-865B-B3D088CAD790", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "冷氣", brand: "國際", 
                name: "加碼贈品", 
                desc: "7/4-7/31\n購買國際指定機型冷氣\n<span class='text-red'>一對一分離式UJ系列2.8KW(含)以下\n即享原廠好禮送</span>\n<span class='text-blue'>40-630019-001\n(贈)國際F-S14KM\n14吋DC電風扇*1</span>\n<span class='text-red'>停產機種不在此限\n數量有限，送完為止</span>", 
                type: "gift",
                barcode: ["4717523402643"], 
                img: "冷氣贈品/S14KM.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                        { 
                cat: "冷氣", brand: "國際", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                        { 
                cat: "冷氣", brand: "日立", 
                name: "日立冷氣月月抽百萬現金\n<span class='text-blue'>每個月都可以抽一次\n因此客人越早買，抽獎次數越多</span>", 
                desc: "2026/4/1 ~ 2026/7/31\n購買日立冷氣分離、窗型、一對多可抽獎\n(一對多機種以室外機計算)\n有打統編不可申請\n<span class='text-red'>最晚登錄時間為:2026/08/06中午12點前</span>\n登錄資料:\n1.發票\n2.產品保證書(需在正本蓋印購買通路店章)\n3.於2026年 8月6日中午12點前登錄完成", 
                barcode:  [""],
                img: "冷氣贈品/H01.jpg",
                qrUrl: "https://twevent26.hitachiaircon.com/PromoteEX/promo/prm001.aspx", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                        { 
                cat: "冷氣", brand: "日立", 
                name: "原廠好禮", 
                desc: "7/4 ~ 7/31\n購買日立指定系列變頻冷氣\nVP豪華系列一對一變頻分離式\n即享好禮送\n<span class='text-blue'>40-630084-001\n(贈)2026日立微波爐HMRM2003*1</span>\n<span class='text-red'>停產機種不在此限\n數量有限，送完為止</span>", 
                barcode:  ["8850207800062"],
                img: "冷氣贈品/HMRM.jpg",
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                        { 
                cat: "冷氣", brand: "日立", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "冷氣", brand: "LG", 
                name: "極智2.0、極淨2.0冷暖系列 \n<span class='text-blue'>就是今年的DHST系列</span>\n登陸贈好禮即享卷<span class='text-red'>$2,000元</span>\ ", 
                desc: "LG活動時間2026/2/1 ~ 5/31\n購買指定型號型號　登錄贈好禮即享卷\n登陸時間為2026/3/1 ~ 2026/6/30\n<span class='text-orange'>LG活贈品登錄活動為LG官方LIN\n請客人在自己的LIN申請\n因為即享卷會直接依照客人LIN的電話簡訊發放</span>", 
                barcode: "", 
                img: "冷氣贈品/LG2026.jpg", 
                qrUrl: "https://liff.line.me/1657320610-MwQld1o9/home", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                        { 
                cat: "冷氣", brand: "LG", 
                name: "極效2.0冷暖系列 \n<span class='text-blue'>就是今年的DST系列</span>\n登陸贈好禮即享卷<span class='text-red'>$1,000元</span>\ ", 
                desc: "LG活動時間2026/2/1 ~ 5/31\n購買指定型號型號　登錄贈好禮即享卷\n登陸時間為2026/3/1 ~ 2026/6/30\n<span class='text-orange'>LG活贈品登錄活動為LG官方LIN\n請客人在自己的LIN申請\n因為即享卷會直接依照客人LIN的電話簡訊發放</span>", 
                barcode: "", 
                img: "冷氣贈品/LG2026.jpg", 
                qrUrl: "https://liff.line.me/1657320610-MwQld1o9/home", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                                    { 
                cat: "冷氣", brand: "LG", 
                name: "一對多系列 \n登陸贈好禮即享卷<span class='text-red'>$2,500元</span>\ ", 
                desc: "LG活動時間2026/2/1 ~ 5/31\n購買指定型號型號　登錄贈好禮即享卷\n登陸時間為2026/3/1 ~ 2026/6/30\n<span class='text-orange'>LG活贈品登錄活動為LG官方LIN\n請客人在自己的LIN申請\n因為即享卷會直接依照客人LIN的電話簡訊發放</span>", 
                barcode: "", 
                img: "冷氣贈品/LG2026.jpg", 
                qrUrl: "https://liff.line.me/1657320610-MwQld1o9/home", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "冷氣", brand: "LG", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "冷氣", brand: "禾聯", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                        { 
                cat: "冷氣", brand: "東元", 
                name: "\n7/1-7/14\n會員專屬\n買東元全系列一對一變頻冷氣贈\n<span class='text-blue'>40-630051-001\n(贈)2026東元XA1628BRD\n16吋DC電扇*1</span>", 
                desc: "<span class='text-red'>停產機種不送\n數量有限，送完為止</span>", 
                type: "gift",
                barcode: ["4718074412228"], // 請換成正確條碼
                img: "冷氣贈品/XA1628.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "冷氣", brand: "東元", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "冷氣", brand: "聲寶", 
                name: "購買聲寶冷氣、冰箱、冷凍櫃、洗衣機、電視、除濕機、清淨機 \n登錄參加抽獎資格\n<span class='text-blue'每月可抽一次</span>\n<span class='text-red'>活動到9/30為止</span>\ ", 
                desc: "聲寶90年義氣相挺喝咖啡活動\n登陸時間為即日起(已開始) ~ 2026/9/30\n<span class='text-blue'>上官網登錄可參加抽獎\n有機會抽中【Balzano】 義式半自動雙膠囊3 in 1咖啡機*1</span>\n</span>得獎公告時間如下:\n<span class='text-red'>　　　　抽獎時間　　公告時間\n第一波　5/29　　　　6/5\n第二波　6/30　　　　7/7\n第三波　7/31　　　　8/7\n第四波　8/31　　　　9/7\n第五波　10/1　　　　10/8</span>", 
                barcode: "", 
                img: "冷氣贈品/SAMPO000.jpg", 
                qrUrl: "https://event.sampo.com.tw/2026q2-campaign", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "冷氣", brand: "聲寶", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "冷氣", brand: "SHARP", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            {
                cat: "冷氣", brand: "富士通", 
                name: "\n(贈)2026品諾DF-1609DR　16吋直流四季DC扇 \n<span class='text-blue'>40-630007-001</span>", 
                desc: "活動時間2026/7/10 ~ 2026/7/19 \n 購買以下兩款冷氣才有送\n<span class='text-blue'>富士通AS/AOCG028KMTC 1-1變頻冷暖空調\n富士通AS/AOCG036KMTC 1-1變頻冷暖空調</span>\n即享好禮送\n<span class='text-red'>數量有限．送完為止</span>", 
                type: "gift",
                barcode: ["4710859912343"], 
                img: "冷氣贈品/1609DR.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "冷氣", brand: "富士通", 
                name: "富士通UTY-HACT1家用APP控制器 \n<span class='text-blue'>40-630002-001</span>", 
                desc: "活動時間2026/1/1 ~ 2026/4/30 \n 只有KGTB系列和一對多室內機可送.請碰扣\nCMTD.KMTC.KBT這幾個系列都是選配沒有送\n提醒\n一對多室外機請碰好禮三選一\n一對多室內機請碰控制器", 
                type: "gift",
                barcode: ["4710829605862"], 
                img: "冷氣贈品/HACT1.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "冷氣", brand: "富士通", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元   \n  3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2026 HX2421/02飛利浦音波牙刷 \n<span class='text-blue'>40-630014-001</span>", 
                desc: "2026/5/1 延長送贈品\n<span class='text-red'>注意後勤備註\n送完為主，請勿超訂</span> \n 三菱全系列1-1變頻分離冷氣享好禮三選一\n<span class='text-red'>一對一和一對多送的贈品不同</span>\n一對一贈品為電動牙刷/16吋電風扇/負離子吹風機", 
                type: "gift",
                barcode: ["8710103968795"], 
                img: "冷氣贈品/2421.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2026 三菱 TD760TW負離子吹風機 \n<span class='text-blue'>40-630037-001</span>", 
                desc: "2026/5/1 延長送贈品\n<span class='text-red'>注意後勤備註\n送完為主，請勿超訂</span> \n 三菱全系列1-1變頻分離冷氣享好禮三選一\n<span class='text-red'>一對一和一對多送的贈品不同</span>\n一對一贈品為電動牙刷/16吋電風扇/負離子吹風機", 
                type: "gift",
                barcode: ["4711216461535"], 
                img: "冷氣贈品/TD760TW.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2026 VESTA 16吋遙控DC風扇 \n<span class='text-blue'>40-630071-001</span>", 
                desc: "2026/5/1 延長送贈品\n<span class='text-red'>注意後勤備註\n送完為主，請勿超訂</span>\n 三菱全系列1-1變頻分離冷氣享好禮三選一\n<span class='text-red'>一對一和一對多送的贈品不同</span>\n一對一贈品為電動牙刷/16吋電風扇/負離子吹風機", 
                type: "gift",
                barcode: ["4711216460538"], 
                img: "冷氣贈品/DC1601.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2026 三菱 ES301-BK除氯蓮蓬頭 \n<span class='text-blue'>40-630029-001</span>", 
                desc: "2026/5/1 延長送贈品\n<span class='text-red'>注意後勤備註\n送完為主，請勿超訂</span> \n 三菱全系列一對多變頻分離冷氣享好禮三選一(以室外機數量計算)\n<span class='text-red'>一對一和一對多送的贈品不同</span>\n一對多贈品為護眼樂/象印電子鍋/除氯蓮蓬頭", 
                type: "gift",
                barcode: ["4962752008818"], 
                img: "冷氣贈品/ES301.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2026 三菱 OS-1251護眼樂Air 2 \n<span class='text-blue'>40-630032-001</span>", 
                desc: "2026/5/1 延長送贈品\n<span class='text-red'>注意後勤備註\n送完為主，請勿超訂</span> \n 三菱全系列一對多變頻分離冷氣享好禮三選一(以室外機數量計算)\n<span class='text-red'>一對一和一對多送的贈品不同</span>\n一對多贈品為護眼樂/象印電子鍋/除氯蓮蓬頭", 
                type: "gift",
                barcode: ["8888657167480"], 
                img: "冷氣贈品/1251.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
             {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2026 象印S-WAF10 6人份電子鍋 \n<span class='text-blue'>40-630074-001</span>", 
                desc: "2026/5/1 延長送贈品\n<span class='text-red'>注意後勤備註\n送完為主，請勿超訂</span> \n 三菱全系列一對多變頻分離冷氣享好禮三選一(以室外機數量計算)\n<span class='text-red'>一對一和一對多送的贈品不同</span>\n一對多贈品為護眼樂/象印電子鍋/除氯蓮蓬頭", 
                type: "gift",
                 barcode: ["4711216460972"], 
                img: "冷氣贈品/WAF10.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                         {
                cat: "冷氣", brand: "三菱重工", 
                name: "(贈)2025airmon智慧遠端控制器 \n<span class='text-blue'>40-630072-001</span>", 
                desc: "活動時間2026/1/1 ~ 2026/4/30 \n <span class='text-red'>只有晴空冷暖有送控制器(以室外機數量計算)</span>", 
                type: "gift",
                barcode: ["4711216460644"], 
                img: "冷氣贈品/air.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "冷氣", brand: "三菱重工", 
                name: "冷氣免運\n免基本安裝費\n$100", 
                desc: "一對一分離式冷氣:  \n 3.6KW以下(含)$3100元  3.7KW - 4.1KW $3500元 \n  4.2KW - 5.2KW $3900元   \n 5.3KW - 6.5KW $4500元\n6.6KW - 7.2KW $5000元  \n   7.3KW - 9.1KW $6000元  \n  9.2KW - 11.6KW $8000元  \n 11.7KW以上$9200元  \n  一對多分離式冷氣:   \n  超出10米以外(以室內機KW計算)   \n 家樂福補助10米(日立冷氣除外)$5000元   \n  窗型/直立式冷氣/移動式:  \n 3.2KW(含)以下$800元  \n   3.21KW - 5.3KW $1000元   \n  超過5.3KW $1200元  \n  只送不裝收費: \n 窗型/直立式 $200/台 \n  一對一分離 $300/組 \n一對二分離式 $400/組   \n 隨貨其他商品100/件", 
                type: "shipping", 
                barcode: ["2449405007012"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
             {
                cat: "日立藝思生活節", brand: "日立", 
                name: "買指定機型冰箱送  \n <span class='text-blue'>40-004136-001</span> \n  (贈)康寧餐具輕瓷保溫/冰吸管杯SN-BZ850DP", 
                desc: "2026/4/1 ~ 2026/7/31 \n(申請截止日2026/8/31) \n 兩門變頻冰箱  \n <span class='text-blue'>HRTN5275MF、HRTN5255MF\nRVX429、RV469</span>\n這四款可贈送", 
                type: "gift", 
                img: "air.jpg", 
                 barcode: ["8888236196603"], 
                img: "日立冰洗/ZX14.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "日立藝思生活節", brand: "日立", 
                name: "藝思即享卷-居家款或享樂款$6000  \n (需線上申請)", 
                desc: "2026/4/1 ~ 2026/7/31 \n(申請截止日2026/8/31) \n 日本製旗艦冰箱  \n <span class='text-blue'>RZXC740KJ、RGG670TJ</span>", 
                barcode: "", 
                img: "日立冰洗/CQQ.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://event.hitachi-homeappliances.com.tw/reg.aspx?id=2097", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "日立藝思生活節", brand: "日立", 
                name: "藝思即享卷-居家款或享樂款$5000  \n (需線上申請)", 
                desc: "2026/4/1 ~ 2026/7/31\n (申請截止日2026/8/31) \n 十字對開琉璃冰箱 \n<span class='text-blue'> HR4N9713DFSVA、HR4N9638ESVAD</span>", 
                barcode: "", 
                img: "日立冰洗/CQQ.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://event.hitachi-homeappliances.com.tw/reg.aspx?id=2097", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "日立藝思生活節", brand: "日立", 
                name: "藝思即享卷-居家款或享樂款$3000  \n (需線上申請)", 
                desc: "2026/4/1 ~ 2026/7/31 \n(申請截止日2026/8/31)\n 買日本製琉璃冰箱 \n <span class='text-blue'> RHW540RJ、RHW620RH</span> \n日本製鋼板冰箱\n<span class='text-blue'>RTSF62WJ、RHSF53NJ</span>\n日本製滾筒洗脫烘\n<span class='text-blue'>BDSX150JJ、BDSX150JJR \nBDSZ150KJ、BDSZ150KJR\nBDSG120JJ、BDSX120HJ\nBDSX120HJR、BDSX115FJ\nBDSX115FJR</span>\n 過熱水蒸氣烘烤微波爐 \n<span class='text-blue'> MROBK5000AT</span>", 
                barcode: "", 
                img: "日立冰洗/CQQ.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://event.hitachi-homeappliances.com.tw/reg.aspx?id=2097", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "日立藝思生活節", brand: "日立", 
                name: "藝思即享卷-居家款或享樂款$2000  \n (需線上申請)", 
                desc: "2026/4/1 ~ 2026/7/31 \n(申請截止日2026/8/31)\n買日本製鋼板冰箱 \n<span class='text-blue'> RHS54TJ、RHS49NJ </span>\n 兩門下冷凍冰箱 \n <span class='text-blue'>HRBN7415DD</span> \n 過熱水蒸氣烘烤微波爐 \n <span class='text-blue'>NROS800AT</span> ", 
                barcode: "", 
                img: "日立冰洗/CQQ.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://event.hitachi-homeappliances.com.tw/reg.aspx?id=2097", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                        {
                cat: "日立藝思生活節", brand: "日立", 
                name: "藝思即享卷-居家款或享樂款$1000  \n (需線上申請)", 
                desc: "2026/4/1 ~ 2026/7/31 \n(申請截止日2026/8/31)\n買兩門變頻鋼板冰箱 \n<span class='text-blue'> HRTN6443S、HRTN6408S</span> \n 直立式變頻洗衣機 \n <span class='text-blue'>LTL12MVW0T、LTLH3MVW0T \nLTL15MVW0T、SF200ZHV\nSF170ZHV</span>\n 熱泵式乾衣機 \n <span class='text-blue'>TD120XFVEM </span>\n獨立式洗碗機\n<span class='text-blue'>HDFF168CV</span>\n過熱水蒸氣烘烤微波爐\n<span class='text-blue'>MROW1000YT</span>", 
                barcode: "", 
                img: "日立冰洗/CQQ.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://event.hitachi-homeappliances.com.tw/reg.aspx?id=2097", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                        { 
                cat: "日立藝思生活節", brand: "日立", 
                name: "49-400006-001\n冰箱免費運費$10", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                type: "shipping1", 
                barcode: ["2449400006027"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                       { 
                cat: "日立藝思生活節", brand: "日立", 
                name: "49-400002-001\n冰箱收費運費$10", 
                desc: "100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                type: "shipping2", 
                barcode: ["2449400002029"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "日立藝思生活節", brand: "日立", 
                name: "49-401006-001\n洗衣機免費運費$10", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                type: "shipping1",                 
                barcode: ["2449401006026"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
                  { 
                cat: "日立藝思生活節", brand: "日立", 
                name: "49-401002-001\n洗衣機收費運費$10", 
                desc: "12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/市內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                type: "shipping2",                 
                barcode: ["2449401002028"], // 請換成正確條碼
                img: "", qrUrl: "", taxUrl: "", oldUrl: "" 
            },
            { 
                cat: "聲寶", brand: "冰箱", 
                name: "購買聲寶冷氣、冰箱、冷凍櫃、洗衣機、電視、除濕機、清淨機 \n登錄參加抽獎資格\n<span class='text-blue'每月可抽一次</span>\n<span class='text-red'>活動到9/30為止</span>\ ", 
                desc: "聲寶90年義氣相挺喝咖啡活動\n登陸時間為即日起(已開始) ~ 2026/9/30\n<span class='text-blue'>上官網登錄可參加抽獎\n有機會抽中【Balzano】 義式半自動雙膠囊3 in 1咖啡機*1</span>\n</span>得獎公告時間如下:\n<span class='text-red'>　　　　抽獎時間　　公告時間\n第一波　5/29　　　　6/5\n第二波　6/30　　　　7/7\n第三波　7/31　　　　8/7\n第四波　8/31　　　　9/7\n第五波　10/1　　　　10/8</span>", 
                barcode: "", 
                img: "冷氣贈品/SAMPO000.jpg", 
                qrUrl: "https://event.sampo.com.tw/2026q2-campaign", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "聲寶", brand: "冰箱", 
                name: "買SR-F61D(S2)、SR-F61DV(Y7)\n<span class='text-blue'>40-105955-001</span>\n(贈)德國卡爾雲朵系列鑄鐵鍋(R65D1)*1\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "<span class='text-red '>2026/05/08 ~ 2026/08/10 </span> \n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["4711420206205", "2449400006027", "2449400002029"], 
               customLabels: ["🎁 贈品",  "🚚 免運$10", "💰 收費$10"], // <--- 在這裡定義
                img: "聲寶冰洗/SAMPO6.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "聲寶", brand: "冰箱", 
                name: "買SR-F42D(Y2)、SR-B46D(R6)\nSR-C48D(S1)、SR-C48DV(Y1)\nSR-B53DV、SR-C53GDV(Y3)\nSR-C48GDV(P2)\n<span class='text-blue'>40-011054-001</span>\n(贈)聲寶旅行茶具8件套(R65C2)*1\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "<span class='text-red '>2026/05/08 ~ 2026/08/10 </span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["4713795351672", "2449400006027", "2449400002029"], 
                img: "聲寶冰洗/SAMPO6.jpg", 
               customLabels: ["🎁 贈品",  "🚚 免運$10", "💰 收費$10"], // <--- 在這裡定義
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
                { 
                cat: "聲寶", brand: "冰箱", 
                name: "買SR-C37D(K5)、SR-C35GD\nSR-M25D\n<span class='text-blue'>40-002086-001</span>\n(贈)聲寶手提胖胖保溫杯(R65C1)*1\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "<span class='text-red '>2026/05/08 ~ 2026/08/10 </span> \n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n500-599公升$700\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                barcode: ["4711720897479", "2449400006027", "2449400002029"], 
               customLabels: ["🎁 贈品",  "🚚 免運$10", "💰 收費$10"], // <--- 在這裡定義
                img: "聲寶冰洗/SAMPO6.jpg", 
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            { 
                cat: "聲寶", brand: "洗衣機", 
                name: "購買聲寶冷氣、冰箱、冷凍櫃、洗衣機、電視、除濕機、清淨機 \n登錄參加抽獎資格\n<span class='text-blue'每月可抽一次</span>\n<span class='text-red'>活動到9/30為止</span>\ ", 
                desc: "聲寶90年義氣相挺喝咖啡活動\n登陸時間為即日起(已開始) ~ 2026/9/30\n<span class='text-blue'>上官網登錄可參加抽獎\n有機會抽中【Balzano】 義式半自動雙膠囊3 in 1咖啡機*1</span>\n</span>得獎公告時間如下:\n<span class='text-red'>　　　　抽獎時間　　公告時間\n第一波　5/29　　　　6/5\n第二波:　6/30　　　　7/7\n第三波　7/31　　　　8/7\n第四波　8/31　　　　9/7\n第五波　10/1　　　　10/8</span>", 
                barcode: "", 
                img: "冷氣贈品/SAMPO000.jpg", 
                qrUrl: "https://event.sampo.com.tw/2026q2-campaign", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
             { 
                cat: "聲寶", brand: "洗衣機", 
                name: "買ES-P19DAS(S1)\n<span class='text-blue'>40-105955-001</span>\n(贈)德國卡爾雲朵系列鑄鐵鍋(R65D1)*1\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "<span class='text-red '>2026/05/08 ~ 2026/07/06</span>  \n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["4711420206205","2449401006026","2449401002028"], 
               customLabels: ["🎁 贈品",  "🚚 免運$10", "💰 收費$10"], // <--- 在這裡定義
                img: "聲寶冰洗/SAMPO6.jpg", 
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
            { 
                cat: "聲寶", brand: "洗衣機", 
                name: "買ES-P17DPS(S1)、ES-P19DPS(S1)\nES-ND12DH、SD-10DH\n<span class='text-blue'>40-104983-001</span>\n(贈)聲寶星漾行旅包(W65C3)*1\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "<span class='text-red '>2026/05/08 ~ 2026/07/06</span>  \n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["4711720897486","2449401006026","2449401002028"], 
               customLabels: ["🎁 贈品",  "🚚 免運$10", "💰 收費$10"], // <--- 在這裡定義
                img: "聲寶冰洗/SAMPO6.jpg", 
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
             { 
                cat: "聲寶", brand: "洗衣機", 
                name: "買ES-B15D、ES-B17D\nES-P16DV(P1)、ES-L14V(G5)\nES-L16V(G5)\n<span class='text-blue'>40-103994-001</span>\n(贈)Lynx清奢旅行五件組(W65C1)*1\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "<span class='text-red '>2026/05/08 ~ 2026/07/06</span>  \n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                barcode: ["4715862482340","2449401006026","2449401002028"], 
               customLabels: ["🎁 贈品",  "🚚 免運$10", "💰 收費$10"], // <--- 在這裡定義
                img: "聲寶冰洗/SAMPO6.jpg", 
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
                        {
                cat: "SONY電視原廠活動", brand: "SONY電視", 
                name: "SONY夏季繽紛好時光\nSONY官網註冊申請即享卷", 
                desc: "發票時間:2026/3/9 ~ 2026/8/9  \n最晚註冊時間為2026/8/16\n<span class='text-blue'>如客人需延後送貨\n請洽SONY業務申請資料備註 </span>\n<span class='text-mblue'>買65XR90M2、85XR50\n65XR80M2、85XR30M2</span>\n這四款註冊送好禮即享卷$5000\n<span class='text-mblue'>買75XR70M2、55XR80M2\n65XR70M2、75XR50</span>\n這四款註冊送好禮即享卷$3000\n<span class='text-mblue'>買55XR80、65XR70\n65XR50、55XR50\n75S30、75XR30M2\n55XR70M2、50XR70M2\n65XR30M2</span>\n這九款註冊送好禮即享卷$2000\n<span class='text-mblue'>買65S31T</span>\n這款註冊送好禮即享卷$1000\n<span class='text-red'>請客人至SONY官網註冊會員並完成商品\n註冊後\n需按下*點我兌換*的按鈕才可以喔!\n兌換流程可點圖片有兌換流程說明</span>", 
                barcode: [""], 
                img: "SONY/SONY20261.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://event.sony.com.tw/2026/06/Summer/?cpint=web:dsp:twinfo:linklsp:26_6__image&utm_id=lsp&utm_source=sony_web_internal&utm_medium=sony_internal_banner&utm_campaign=SSO_Main&utm_content=26_6__image&utm_term=26_6_pe_sony_web_internal_sony_internal_banner_SSO_Main_", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "日本製電冰箱無邊框鏡面/玻璃系列F651", 
                name: "買NR-F651WX登錄送\n<span class='text-blue'>40-013998-001</span>\n(贈)SP-2608不鏽鋼雙鍋組*1\n<span class='text-blue'>$5000元節能回饋</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-F651WX",
                barcode: ["4009839713620", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A1.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=CC49B685-0A02-4FA4-BB33-AA7FD72AB27C", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "國際夏日有禮賞", brand: "日本製電冰箱無邊框鏡面/玻璃系列(其他款)", 
                name: "買NR-F601WX、NR-F551WX、NR-F521HX登錄送\n<span class='text-blue'>40-013998-001</span>\n(贈)SP-2608不鏽鋼雙鍋組*1\n<span class='text-blue'>$3000元節能回饋</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-F601WX,NR-F551WX,NR-F521HX",
                barcode: ["4009839713620", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A2.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=CC49B685-0A02-4FA4-BB33-AA7FD72AB27C", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "國際夏日有禮賞", brand: "日本製電冰箱鋼板系列", 
                name: "買NR-F601XT、NR-E507XT、NR-E417XT登錄送\n<span class='text-blue'>40-013998-001</span>\n(贈)SP-2608不鏽鋼雙鍋組*1\n<span class='text-blue'>$2000元節能回饋</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-F601XT,NR-E507XT,NR-E417XT",
                barcode: ["4009839713620", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A3.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=CC49B685-0A02-4FA4-BB33-AA7FD72AB27C", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "國際夏日有禮賞", brand: "變頻電冰箱玻璃/鋼板系列(400L以上)(日本製除外)(XGS/XV系列)", 
                name: "買NR-D615XGS、NR-C615XGS、NR-D505XGS、NR-C505XGS、NR-C454HG、NR-D615XV、NR-D505XV、NR-C615XV、NR-C505XV、NR-C454HV、NR-B656TV、NR-B586TV、NR-B496TV、NR-B426TV送\n<span class='text-blue'>40-004137-001\n(贈)SP-2610可微波不鏽鋼保鮮盒三入組*1</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-D615XGS、NR-C615XGS、NR-D505XGS、NR-C505XGS、NR-C454HG、NR-D615XV、NR-D505XV、NR-C615XV、NR-C505XV、NR-C454HV、NR-B656TV、NR-B586TV、NR-B496TV、NR-B426TV",
                barcode: ["6939749620146", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A5.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "國際夏日有禮賞", brand: "變頻電冰箱玻璃系列(PG系列)", 
                name: "買NR-C501PG登錄送\n<span class='text-blue'>40-004137-001</span>\n(贈)SP-2610可微波不鏽鋼保鮮盒三入組*1\n<span class='text-blue'>$2000元節能回饋</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-C501PG",
                barcode: ["6939749620146", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A4.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=CC49B685-0A02-4FA4-BB33-AA7FD72AB27C", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "國際夏日有禮賞", brand: "變頻電冰箱(400L以下)", 
                name: "買NR-C384HV、NR-C384HVL、NR-B371TV、NR-B331VG、NR-B301VG送\n<span class='text-blue'>40-003064-001\n(贈)SP-2612陶瓷防燙隨手機三入組*1</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-C384HV,NR-C384HVL,NR-B371TV,NR-B331VG,NR-B301VG",
                barcode: ["6503533673207", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A6.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "https://www.etax.nat.gov.tw/etwmain/etw210w/cases/services/OLFCDT01/0", 
                oldUrl: "https://save3000.moeaea.gov.tw/subsidy02/index/index.aspx" 
            },
            {
                cat: "國際夏日有禮賞", brand: "冷凍櫃", 
                name: "買NR-FZ383AV-S、NR-FZ255AV-S、NR-FZ175AV-S送\n<span class='text-blue'>40-122059-001\n(贈)SP-2613陶瓷石紋碗*1</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n100公升以下$200\n101-199公升$250\n200-299公升$300\n300-399公升$450\n400-499公升$500\n600公升以上$900\n對開冰箱$1200\nLG敲敲看冰箱$1500\n電子衣櫥$600\n1.拆大門/室內門/過窗$200\n2.拆冰箱門$1500/門\n3.冰箱過扶手$300\n4.對開冰箱過扶手$500", 
                model: "NR-FZ383AV-S、NR-FZ255AV-S、NR-FZ175AV-S",
                barcode: ["4715754026133", "2449400006027", "2449400002029"], 
                img: "國際冰箱/A7.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "台灣製熱泵滾筒洗衣機", 
                name: "買NA-V170RPH、NA-V150RPH\n登錄送\n<span class='text-blue'>40-013998-001</span>\n(贈)SP-2608不鏽鋼雙鍋組*1\n<span class='text-blue'>40-110176-001</span>\n(贈)南僑水晶洗劑SP-NA02*1\n<span class='text-blue'>$3000元節能回饋</span>\n第一跟第二是贈品\n第三個免運$10\n第四個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NA-V170RPH、NA-V150RPH",
                barcode: ["4009839713620","4710060009153" ,"2449401006026", "2449401002028"], 
                img: "國際冰箱/A8.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=7A7E5BF7-E981-4721-9926-2ABA4D20E623", 
                taxUrl: "", 
                oldUrl: "" 
            },
             {
                cat: "國際夏日有禮賞", brand: "AI智慧雙控洗烘衣機", 
                name: "買NA-V1715SP、NA-V1515SP\n登錄送\n<span class='text-blue'>40-013998-001</span>\n(贈)SP-2608不鏽鋼雙鍋組*1\n<span class='text-blue'>$3000元節能回饋</span>\n第一個是贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NA-V1715SP、NA-V1515SP",
                barcode: ["4009839713620","2449401006026","2449401002028"], 
                img: "國際冰箱/A9.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=7A7E5BF7-E981-4721-9926-2ABA4D20E623", 
                taxUrl: "", 
                oldUrl: "" 
            },
             {
                cat: "國際夏日有禮賞", brand: "淨護完美洗烘衣機組", 
                name: "買NA-VS120RW-B + NH-VS100HP-B(合購)\n登錄送\n<span class='text-blue'>40-013998-001</span>\n(贈)SP-2608不鏽鋼雙鍋組*1\n<span class='text-blue'>40-110176-001</span>\n(贈)南僑水晶洗劑SP-NA02*1\n<span class='text-blue'>40-103993-001</span>\n(贈)SP-2611強化餐盤八件組*1\n<span class='text-blue'>$3000元節能回饋</span>\n第一跟第二跟第三是贈品\n第四個免運$10\n第五個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NA-VS120RW-B、NH-VS100HP-B",
                barcode: ["4009839713620","4710060009153","4717879104451","2449401006026","2449401002028"], 
                img: "國際冰箱/A11.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "https://pstw.panasonic.com.tw/SalesEvent/Activity/Add?EventID=E0211A45-24BA-4314-AB33-04EB946B0622", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "熱泵除濕式乾衣機", 
                name: "買NH-VS100HP-B送\n<span class='text-blue'>40-013998-001\n(贈)SP-2608不鏽鋼雙鍋組*1</span>\n第一個是贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NH-VS100HP-B",
                barcode: ["4009839713620","2449401006026","2449401002028"], 
                img: "國際冰箱/A10.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "變頻溫水滾筒和直立洗衣機", 
                name: "買NA-VS120RW-B、NA-V190RDH、NA-V170MDH、NA-V150MDH、NA-V220NMS、NA-V200NMS、NA-V190NM、NA-V190NMS、NA-V170NM、NA-V170NMS、NA-V150NM、NA-V150NMS送\n<span class='text-blue'>40-103993-001</span>\n(贈)SP-2611強化餐具八件組*1\n<span class='text-blue'>40-110176-001</span>\n(贈)南僑水晶洗劑SP-NA02*1\n第一跟第二是贈品\n第三個免運$10\n第四個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NA-VS120RW-B、NA-V190RDH、NA-V170MDH、NA-V150MDH、NA-V220NMS、NA-V200NMS、NA-V190NM、NA-V190NMS、NA-V170NM、NA-V170NMS、NA-V150NM、NA-V150NMS",
                barcode: ["4717879104451","4710060009153","2449401006026","2449401002028"], 
                img: "國際冰箱/A12.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "乾衣機", 
                name: "買NH-80RZ-W、NH-70G-L送\n<span class='text-blue'>40-122059-001\n(贈)SP-2613陶瓷石紋碗*1</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NH-80RZ-W、NH-70G-L",
                barcode: ["4715754026133","2449401006026","2449401002028"], 
                img: "國際冰箱/A7.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "變頻滾筒洗衣機和變頻直立式洗衣機", 
                name: "買NA-V190RW、NA-V170SW、NA-V150SW、NA-V190MT、NA-V170MT、NA-V150MT、NA-V130LB(S)、NA-V120LBS、NA-V110LB(S)送\n<span class='text-blue'>40-103993-001\n(贈)SP-2611強化餐具八件組*1</span>\n第一個是贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NA-V190RW、NA-V170SW、NA-V150SW、NA-V190MT、NA-V190MT(S)、NA-V170MT、NA-V170MT(S)、NA-V150MT、NA-V130LBS、NA-V130LB、NA-V120LB、NA-V120LBS、NA-V110LB、NA-V110LBS",
                barcode: ["4717879104451","2449401006026","2449401002028"], 
                img: "國際冰箱/A13.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            },
            {
                cat: "國際夏日有禮賞", brand: "非變頻系列洗衣機", 
                name: "買NA-150MU、NA-120EB、NA-110EB、NA-90EB送\n<span class='text-blue'>40-003064-001\n(贈)SP-2612陶瓷防燙隨手機三入組*1</span>\n第一個贈品\n第二個免運$10\n第三個收費$10", 
                desc: "發票日期:\n<span class='text-blue'>2026.04.10~2026.08.19</span>\n登錄最晚時間:\n<span class='text-blue'>2026.09.02</span>\n12公斤(含)以下$300\n13-18公斤$400\n19公斤以上$500\nLG上乾下洗$2700\n滾筒洗衣機12公斤(含)以下$600\n滾筒洗衣機13-16公斤$700\n滾筒洗衣機17公斤以上$750\nLG下洗迷你洗衣機$300\n乾衣機10公斤$250\n乾衣機11公斤以上$300\n免曬衣乾衣機$500\n1.拆大門/室內門/過窗$200\n2.直立式洗衣機過扶手$300\n3.滾筒洗衣機過扶手$500\n國際上下洗運費$2000", 
                model: "NA-150MU、NA-120EB、NA-110EB、NA-90EB",
                barcode: ["6503533673207","2449401006026","2449401002028"], 
                img: "國際冰箱/A6.jpg", // 請確保 GitHub 上檔案名為 ka10r.jpg (小寫)
                qrUrl: "", 
                taxUrl: "", 
                oldUrl: "" 
            }
];
